# Pandas data manipulation

In [ ]:
import pandas as pd

## Import new dataset and explore it

In [12]:
cars = pd.read_csv('automobile_data.csv', sep=',', index_col=0)

In [16]:
cars

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [17]:
cars['company']

index
0     alfa-romero
1     alfa-romero
2     alfa-romero
3            audi
4            audi
         ...
81     volkswagen
82     volkswagen
86     volkswagen
87          volvo
88          volvo
Name: company, Length: 61, dtype: object

In [21]:
cars['company'].unique()

array(['alfa-romero', 'audi', 'bmw', 'chevrolet', 'dodge', 'honda',
       'isuzu', 'jaguar', 'mazda', 'mercedes-benz', 'mitsubishi',
       'nissan', 'porsche', 'toyota', 'volkswagen', 'volvo'], dtype=object)

In [40]:
# Clean a bit the dataframe because the index are not continuous (61 rows, but index reach until 88)
cars.reset_index(inplace=True, drop=True)  
cars

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
56,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

## See first and last rows of the dataframe

In [36]:
cars.head(1)

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0

In [37]:
cars.tail(1)

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
60,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

### First exercise: show the first five and the last 5 entries in the dataframe (in different commands)

## Select rows based on row number

In [45]:
cars.iloc[1]

company             alfa-romero
body-style          convertible
wheel-base                 88.6
length                    168.8
engine-type                dohc
num-of-cylinders           four
horsepower                  111
average-mileage              21
price                     16500
Name: 1, dtype: object

In [46]:
cars.iloc[1:3]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0

In [47]:
cars.iloc[[1,5,8,42]]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
8,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
42,nissan,sedan,94.5,165.3,ohc,four,69,31,6849.0

In [48]:
cars.iloc[[1,5,8,42]]['horsepower']  # even more "chopping"

1     111
5     110
8     101
42     69
Name: horsepower, dtype: int64

Do you miss **booleans** (True or False)? I miss booleans, let's do boleans. Let's find out which of the rows in the sublist of cars have the highest price.

In [66]:
subsection_cars = cars.iloc[[1,5,8,42]]
subsection_cars.price == subsection_cars['price'].max()

1     False
5     False
8      True
42    False
Name: price, dtype: bool

In [68]:
subsection_cars[subsection_cars.price == subsection_cars['price'].max()]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
8,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0

Let's select all the cars from the company bmw

In [74]:
cars[cars['company']=='bmw']

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
7,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
9,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
10,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
12,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

Now all the cars with horsepower above 120

In [75]:
cars[cars['horsepower']>120]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
9,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
10,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
12,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
24,jaguar,sedan,113.0,199.6,dohc,six,176,15,32250.0
25,jaguar,sedan,113.0,199.6,dohc,six,176,15,35550.0
26,jaguar,sedan,102.0,191.7,ohcv,twelve,262,13,36000.0
32,mercedes-benz,sedan,110.0,190.9,ohc,five,123,22,25552.0
33,mercedes-benz,wagon,110.0,190.9,ohc,five,123,22,28248.0
34,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
35,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
44,nissan,sedan,100.4,184.6,ohcv,six,152,19,13499.0
45,porsche,hardtop,89.5,168.9,ohcf,six,207,17,34028.0
46,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
47,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN
54,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

### Second Exercise find the most expensive car in the whole cars dataframe

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

Now print only the name and the price

          company    price
35  mercedes-benz  45400.0

Let's count how many cars of each body-style are in the dataframe

In [76]:
cars['body-style'].value_counts()

sedan          32
hatchback      15
wagon           9
convertible     3
hardtop         2
Name: body-style, dtype: int64

### Third exercise: Count how many cars of each company are present in the dataframe

toyota           7
bmw              6
mazda            5
nissan           5
mercedes-benz    4
mitsubishi       4
audi             4
volkswagen       4
jaguar           3
chevrolet        3
isuzu            3
porsche          3
honda            3
alfa-romero      3
dodge            2
volvo            2
Name: company, dtype: int64

## Data per company

In [80]:
car_companies = cars.groupby('company')  # This creates a pandas object that is not readable by itself
car_companies

We can see that we have an iterable object that has grouped all the entries based on the value that the column 'company' contains. We shouldn't use a for loop to operate with it, but we will use it now just to illustrate that all the data is there, just not visible for the moment.

In [83]:
for company in car_companies:
    print(company)

('alfa-romero',        company   body-style  wheel-base  length engine-type num-of-cylinders  \
0  alfa-romero  convertible        88.6   168.8        dohc             four
1  alfa-romero  convertible        88.6   168.8        dohc             four
2  alfa-romero    hatchback        94.5   171.2        ohcv              six

   horsepower  average-mileage    price
0         111               21  13495.0
1         111               21  16500.0
2         154               19  16500.0  )
('audi',   company body-style  wheel-base  length engine-type num-of-cylinders  \
3    audi      sedan        99.8   176.6         ohc             four
4    audi      sedan        99.4   176.6         ohc             five
5    audi      sedan        99.8   177.3         ohc             five
6    audi      wagon       105.8   192.7         ohc             five

   horsepower  average-mileage    price
3         102               24  13950.0
4         115               18  17450.0
5         110               19  15250.0
6         110               19  18920.0  )
('bmw',    company body-style  wheel-base  length engine-type num-of-cylinders  \
7      bmw      sedan       101.2   176.8         ohc             four
8      bmw      sedan       101.2   176.8         ohc             four
9      bmw      sedan       101.2   176.8         ohc              six
10     bmw      sedan       103.5   189.0         ohc              six
11     bmw      sedan       103.5   193.8         ohc              six
12     bmw      sedan       110.0   197.0         ohc              six

    horsepower  average-mileage    price
7          101               23  16430.0
8          101               23  16925.0
9          121               21  20970.0
10         182               16  30760.0
11         182               16  41315.0
12         182               15  36880.0  )
('chevrolet',       company body-style  wheel-base  length engine-type num-of-cylinders  \
13  chevrolet  hatchback        88.4   141.1           l            three
14  chevrolet  hatchback        94.5   155.9         ohc             four
15  chevrolet      sedan        94.5   158.8         ohc             four

    horsepower  average-mileage   price
13          48               47  5151.0
14          70               38  6295.0
15          70               38  6575.0  )
('dodge',    company body-style  wheel-base  length engine-type num-of-cylinders  \
16   dodge  hatchback        93.7   157.3         ohc             four
17   dodge  hatchback        93.7   157.3         ohc             four

    horsepower  average-mileage   price
16          68               31  6377.0
17          68               31  6229.0  )
('honda',    company body-style  wheel-base  length engine-type num-of-cylinders  \
18   honda      wagon        96.5   157.1         ohc             four
19   honda      sedan        96.5   175.4         ohc             four
20   honda      sedan        96.5   169.1         ohc             four

    horsepower  average-mileage    price
18          76               30   7295.0
19         101               24  12945.0
20         100               25  10345.0  )
('isuzu',    company body-style  wheel-base  length engine-type num-of-cylinders  \
21   isuzu      sedan        94.3   170.7         ohc             four
22   isuzu      sedan        94.5   155.9         ohc             four
23   isuzu      sedan        94.5   155.9         ohc             four

    horsepower  average-mileage   price
21          78               24  6785.0
22          70               38     NaN
23          70               38     NaN  )
('jaguar',    company body-style  wheel-base  length engine-type num-of-cylinders  \
24  jaguar      sedan       113.0   199.6        dohc              six
25  jaguar      sedan       113.0   199.6        dohc              six
26  jaguar      sedan       102.0   191.7        ohcv           twelve

    horsepower  average-mileage    price
24         176               15  32250.0
25         176               15  35550.0
26         262               13  36000.0  )
('mazda',    company body-style  wheel-base  length engine-type num-of-cylinders  \
27   mazda  hatchback        93.1   159.1         ohc             four
28   mazda  hatchback        93.1   159.1         ohc             four
29   mazda  hatchback        93.1   159.1         ohc             four
30   mazda  hatchback        95.3   169.0       rotor              two
31   mazda      sedan       104.9   175.0         ohc             four

    horsepower  average-mileage    price
27          68               30   5195.0
28          68               31   6095.0
29          68               31   6795.0
30         101               17  11845.0
31          72               31  18344.0  )
('mercedes-benz',           company body-style  wheel-base  length engine-type num-of-cylinders  \
32  mercedes-benz      sedan       110.0   190.9         ohc             five
33  mercedes-benz      wagon       110.0   190.9         ohc             five
34  mercedes-benz      sedan       120.9   208.1        ohcv            eight
35  mercedes-benz    hardtop       112.0   199.2        ohcv            eight

    horsepower  average-mileage    price
32         123               22  25552.0
33         123               22  28248.0
34         184               14  40960.0
35         184               14  45400.0  )
('mitsubishi',        company body-style  wheel-base  length engine-type num-of-cylinders  \
36  mitsubishi  hatchback        93.7   157.3         ohc             four
37  mitsubishi  hatchback        93.7   157.3         ohc             four
38  mitsubishi      sedan        96.3   172.4         ohc             four
39  mitsubishi      sedan        96.3   172.4         ohc             four

    horsepower  average-mileage   price
36          68               37  5389.0
37          68               31  6189.0
38          88               25  6989.0
39          88               25  8189.0  )
('nissan',    company body-style  wheel-base  length engine-type num-of-cylinders  \
40  nissan      sedan        94.5   165.3         ohc             four
41  nissan      sedan        94.5   165.3         ohc             four
42  nissan      sedan        94.5   165.3         ohc             four
43  nissan      wagon        94.5   170.2         ohc             four
44  nissan      sedan       100.4   184.6        ohcv              six

    horsepower  average-mileage    price
40          55               45   7099.0
41          69               31   6649.0
42          69               31   6849.0
43          69               31   7349.0
44         152               19  13499.0  )
('porsche',     company   body-style  wheel-base  length engine-type num-of-cylinders  \
45  porsche      hardtop        89.5   168.9        ohcf              six
46  porsche  convertible        89.5   168.9        ohcf              six
47  porsche    hatchback        98.4   175.7       dohcv            eight

    horsepower  average-mileage    price
45         207               17  34028.0
46         207               17  37028.0
47         288               17      NaN  )
('toyota',    company body-style  wheel-base  length engine-type num-of-cylinders  \
48  toyota  hatchback        95.7   158.7         ohc             four
49  toyota  hatchback        95.7   158.7         ohc             four
50  toyota  hatchback        95.7   158.7         ohc             four
51  toyota      wagon        95.7   169.7         ohc             four
52  toyota      wagon        95.7   169.7         ohc             four
53  toyota      wagon        95.7   169.7         ohc             four
54  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0  )
('volkswagen',        company body-style  wheel-base  length engine-type num-of-cylinders  \
55  volkswagen      sedan        97.3   171.7         ohc             four
56  volkswagen      sedan        97.3   171.7         ohc             four
57  volkswagen      sedan        97.3   171.7         ohc             four
58  volkswagen      sedan        97.3   171.7         ohc             four

    horsepower  average-mileage   price
55          52               37  7775.0
56          85               27  7975.0
57          52               37  7995.0
58         100               26  9995.0  )
('volvo',    company body-style  wheel-base  length engine-type num-of-cylinders  \
59   volvo      sedan       104.3   188.8         ohc             four
60   volvo      wagon       104.3   188.8         ohc             four

    horsepower  average-mileage    price
59         114               23  12940.0
60         114               23  13415.0  )

Now we want to know the maximum car price per company. To do that we'll use this grouped object and ask for its maximum values:

In [109]:
car_companies['price'].max()

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

In [110]:
car_companies['price'].min()

company
alfa-romero      13495.0
audi             13950.0
bmw              16430.0
chevrolet         5151.0
dodge             6229.0
honda             7295.0
isuzu             6785.0
jaguar           32250.0
mazda             5195.0
mercedes-benz    25552.0
mitsubishi        5389.0
nissan            6649.0
porsche          34028.0
toyota            5348.0
volkswagen        7775.0
volvo            12940.0
Name: price, dtype: float64

### Fourth exercise: Put both the maximum and minimum horsepower of each brand in a dataframe with the columns 'max_hp' and 'min_hp' respectively. This can be done in one line if you feel like facing a challenge.

                   max      min
company
alfa-romero    16500.0  13495.0
audi           18920.0  13950.0
bmw            41315.0  16430.0
chevrolet       6575.0   5151.0
dodge           6377.0   6229.0
honda          12945.0   7295.0
isuzu           6785.0   6785.0
jaguar         36000.0  32250.0
mazda          18344.0   5195.0
mercedes-benz  45400.0  25552.0
mitsubishi      8189.0   5389.0
nissan         13499.0   6649.0
porsche        37028.0  34028.0
toyota         15750.0   5348.0
volkswagen      9995.0   7775.0
volvo          13415.0  12940.0

## Sort a dataframe based on the values of a column

Dataframes can be sorted according based on the data that it contains. Let's sort the cars dataframe based on their horsepower:

In [116]:
cars.sort_values(by='horsepower', ascending=True)

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
55,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7775.0
57,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
40,nissan,sedan,94.5,165.3,ohc,four,55,45,7099.0
49,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
...,...,...,...,...,...,...,...,...,...
34,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
45,porsche,hardtop,89.5,168.9,ohcf,six,207,17,34028.0
26,jaguar,sedan,102.0,191.7,ohcv,twelve,262,13,36000.0
47,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

### Fifth exercise: sort the dataframe from more expensive to cheaper, then save it into a new variable and reset the index (dropping the original index).

In [121]:
expensive_to_cheap_cars = cars.sort_values(by='price', ascending=False)
expensive_to_cheap_cars.reset_index(inplace=True, drop = True)
expensive_to_cheap_cars

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
1,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
2,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
3,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
4,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...
56,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
57,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
58,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
59,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
60,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

### Sixth exercise: Now remove all the rows for which the price is not a number (NaN)

Tip: check the `.notna()` function and remember how we normally subset dataframes. For reference, `isna()` does the opposite action.

In [127]:
expensive_to_cheap_cars[expensive_to_cheap_cars['price'].notna()]

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
1,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
2,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
3,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
4,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
5,jaguar,sedan,102.0,191.7,ohcv,twelve,262,13,36000.0
6,jaguar,sedan,113.0,199.6,dohc,six,176,15,35550.0
7,porsche,hardtop,89.5,168.9,ohcf,six,207,17,34028.0
8,jaguar,sedan,113.0,199.6,dohc,six,176,15,32250.0
9,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
10,mercedes-benz,wagon,110.0,190.9,ohc,five,123,22,28248.0
11,mercedes-benz,sedan,110.0,190.9,ohc,five,123,22,25552.0
12,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
13,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
14,mazda,sedan,104.9,175.0,ohc,four,72,31,18344.0
15,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
16,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
17,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
18,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
19,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
20,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0
21,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
22,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
23,nissan,sedan,100.4,184.6,ohcv,six,152,19,13499.0
24,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
25,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0
26,honda,sedan,96.5,175.4,ohc,four,101,24,12945.0
27,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
28,mazda,hatchback,95.3,169.0,rotor,two,101,17,11845.0
29,honda,sedan,96.5,169.1,ohc,four,100,25,10345.0
30,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
31,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
32,mitsubishi,sedan,96.3,172.4,ohc,four,88,25,8189.0
33,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
34,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
35,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
36,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7775.0
37,nissan,wagon,94.5,170.2,ohc,four,69,31,7349.0
38,honda,wagon,96.5,157.1,ohc,four,76,30,7295.0
39,nissan,sedan,94.5,165.3,ohc,four,55,45,7099.0
40,mitsubishi,sedan,96.3,172.4,ohc,four,88,25,6989.0
41,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
42,nissan,sedan,94.5,165.3,ohc,four,69,31,6849.0
43,mazda,hatchback,93.1,159.1,ohc,four,68,31,6795.0
44,isuzu,sedan,94.3,170.7,ohc,four,78,24,6785.0
45,nissan,sedan,94.5,165.3,ohc,four,69,31,6649.0
46,chevrolet,sedan,94.5,158.8,ohc,four,70,38,6575.0
47,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
48,dodge,hatchback,93.7,157.3,ohc,four,68,31,6377.0
49,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,chevrolet,hatchback,94.5,155.9,ohc,four,70,38,6295.0
51,dodge,hatchback,93.7,157.3,ohc,four,68,31,6229.0
52,mitsubishi,hatchback,93.7,157.3,ohc,four,68,31,6189.0
53,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0
54,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
55,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
56,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
57,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0

## Now let's add another entry to our original dataframe `cars`

In [172]:
new_entry = pd.DataFrame(data=[['opel', 'sedan', 100.0, 200.0, 'ohc', 'six', 100, 30, 25050.0]], columns = cars.columns)
new_entry

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,opel,sedan,100.0,200.0,ohc,six,100,30,25050.0

In [173]:
cars_with_new_entries = pd.concat([cars, new_entry])
cars_with_new_entries

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
57,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0
0,opel,sedan,100.0,200.0,ohc,six,100,30,25050.0

### Seventh exercise: concatenate the following dataframes that I provide bellow.

In [175]:
dfa = pd.DataFrame({'first_column':[1,2,3,4,5], 'second_colum':['A','B','C','D','E']})
dfa

   first_column second_colum
0             1            A
1             2            B
2             3            C
3             4            D
4             5            E

In [176]:
dfb = pd.DataFrame({'first_column':[6,7], 'second_colum':['F', 'G']})
dfb

   first_column second_colum
0             6            F
1             7            G

In [178]:
concat_df = pd.concat([dfa, dfb])
concat_df

   first_column second_colum
0             1            A
1             2            B
2             3            C
3             4            D
4             5            E
0             6            F
1             7            G

## Merge dataframes

In [179]:
dfa = pd.DataFrame({'first_column':[1,2,3,4,5], 'second_colum':['A','B','C','D','E']})
dfa

   first_column second_colum
0             1            A
1             2            B
2             3            C
3             4            D
4             5            E

In [182]:
extra_info_df = pd.DataFrame({'first_column':[1,4,3,6], 'new_column': ['ham', 'eggs', 'spam', 'bacon']})
extra_info_df

   first_column new_column
0             1        ham
1             4       eggs
2             3       spam
3             6      bacon

In [185]:
merged_df = pd.merge(dfa,extra_info_df, on='first_column', how='left')  # Only keeps entries in dfa
merged_df

   first_column second_colum new_column
0             1            A        ham
1             2            B        NaN
2             3            C       spam
3             4            D       eggs
4             5            E        NaN

In [186]:
merged_df = pd.merge(dfa,extra_info_df, on='first_column', how='right')  # Only keeps entries in extra_info_df
merged_df

   first_column second_colum new_column
0             1            A        ham
1             3            C       spam
2             4            D       eggs
3             6          NaN      bacon

In [188]:
merged_df = pd.merge(dfa,extra_info_df, on='first_column', how='inner')  # Only keeps entries that appear both in dfa and extra_info_df
merged_df

   first_column second_colum new_column
0             1            A        ham
1             3            C       spam
2             4            D       eggs

In [190]:
merged_df = pd.merge(dfa,extra_info_df, on='first_column', how='outer')  # Keeps all the entries, it doesn't matter if it only appears on one of the dataframes
merged_df

   first_column second_colum new_column
0             1            A        ham
1             2            B        NaN
2             3            C       spam
3             4            D       eggs
4             5            E        NaN
5             6          NaN      bacon